In [1]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [46]:
train_data = pd.read_csv(r"C:\Users\123\Desktop\university\sem 3\AI lab\Assignments\task-12\train.csv")
test_data = pd.read_csv(r"C:\Users\123\Desktop\university\sem 3\AI lab\Assignments\task-12\test.csv")
gender_submission = pd.read_csv(r"C:\Users\123\Desktop\university\sem 3\AI lab\Assignments\task-12\gender_submission.csv")

# train data preprosessing

In [47]:
train_data.fillna(train_data['Age'].mean(), inplace= True)

In [48]:
train_data['Age'] = train_data['Age'].astype(int)

In [49]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    int32
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(1), int32(1), int64(5), object(5)
memory usage: 80.2+ KB

In [50]:
train_data_1 = train_data.drop(columns = ['PassengerId','Name','Ticket','Fare','Cabin'])

In [51]:
train_data_1.sample(5)

     Survived  Pclass   Sex  Age  SibSp  Parch Embarked
263         0       1  male   40      0      0        S
377         0       1  male   27      0      2        C
828         1       3  male   29      0      0        Q
213         0       2  male   30      0      0        S
295         0       1  male   29      0      0        C

In [52]:
train_data_1['Embarked'] = train_data_1['Embarked'].astype(str)

In [53]:
train_data_1['Embarked'] = train_data_1['Embarked'].str.strip()

In [54]:
x_train = train_data_1.drop(columns = 'Survived')
y_train = train_data_1['Survived']

In [55]:
print(x_train.shape)
print(y_train.shape)

(891, 6)
(891,)

In [94]:
print(x_train.dtypes)

Pclass      int64
Sex         int32
Age         int32
SibSp       int64
Parch       int64
Embarked    int32
dtype: object

In [90]:
le = LabelEncoder()

In [91]:
x_train['Sex'] = le.fit_transform(x_train['Sex'])

In [93]:
x_train['Embarked'] = le.fit_transform(x_train['Embarked'])

In [71]:
y_train.dtype

dtype('int64')

In [73]:
train_data_1['Embarked'] = le.fit_transform(train_data_1['Embarked'])
train_data_1['Sex'] = le.fit_transform(train_data_1['Sex'])

In [77]:
train_data_1.sample(10)

     Survived  Pclass  Sex  Age  SibSp  Parch  Embarked
157         0       3    1   30      0      0         3
737         1       1    1   35      0      0         1
488         0       3    1   30      0      0         3
660         1       1    1   50      2      0         3
266         0       3    1   16      4      1         3
622         1       3    1   20      1      1         1
349         0       3    1   42      0      0         3
685         0       2    1   25      1      2         1
749         0       3    1   31      0      0         2
374         0       3    0    3      3      1         3

# test data preprocessing

In [78]:
test_data['Age'].fillna(test_data['Age'].mean(), inplace = True)
test_data['Age'] = test_data['Age'].astype(int)

C:\Users\123\AppData\Local\Temp\ipykernel_19848\3001045704.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  test_data['Age'].fillna(test_data['Age'].mean(), inplace = True)

In [79]:
test_data_1 = test_data.drop(columns = ['PassengerId','Name','Ticket','Fare','Cabin'])

In [80]:
x_test = test_data_1

In [81]:
test_data.sample(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
153,1045,3,"Klasen, Mrs. (Hulda Kristina Eugenia Lofqvist)",female,36,0,2,350405,12.1833,NaN,S
95,987,3,"Tenglin, Mr. Gunnar Isidor",male,25,0,0,350033,7.7958,NaN,S

In [103]:
x_test.dtypes

Pclass      int64
Sex         int32
Age         int32
SibSp       int64
Parch       int64
Embarked    int32
dtype: object

In [102]:
x_test['Sex'] = le.fit_transform(x_test['Sex'])
x_test['Embarked'] = le.fit_transform(x_test['Embarked'])

In [83]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          418 non-null    int32
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(1), int32(1), int64(4), object(5)
memory usage: 34.4+ KB

In [84]:
test_data.sample(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
98,990,3,"Braf, Miss. Elin Ester Maria",female,20,0,0,347471,7.8542,NaN,S
282,1174,3,"Fleming, Miss. Honora",female,30,0,0,364859,7.7500,NaN,Q
402,1294,1,"Gibson, Miss. Dorothy Winifred",female,22,0,1,112378,59.4000,NaN,C
133,1025,3,"Thomas, Mr. Charles P",male,30,1,0,2621,6.4375,NaN,C
369,1261,2,"Pallas y Castello, Mr. Emilio",male,29,0,0,SC/PARIS 2147,13.8583,NaN,C

# models

In [95]:
from sklearn.svm import SVC
from sklearn.ensemble import RandomForestClassifier, ExtraTreesClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.metrics import accuracy_score, classification_report

In [109]:
gender_submission.drop('PassengerId', axis = 1, inplace=True)

In [96]:
svc = SVC()
rfc = RandomForestClassifier()
etc = ExtraTreesClassifier()
lr = LogisticRegression()
dtc = DecisionTreeClassifier()
knc = KNeighborsClassifier()

# SVC

In [120]:
svc.fit(x_train, y_train)
y_pred = svc.predict(x_test)
print(accuracy_score(gender_submission, y_pred))

0.6411483253588517

# RandomForestClassifier

In [121]:
rfc.fit(x_train, y_train)
y_pred = rfc.predict(x_test)
print(accuracy_score(gender_submission, y_pred))

0.8636363636363636

# ExtraTreesClassifier

In [122]:
etc.fit(x_train, y_train)
y_pred = etc.predict(x_test)
print(accuracy_score(gender_submission, y_pred))

0.8588516746411483

# LogisticRegression

In [123]:
lr.fit(x_train, y_train)
y_pred = lr.predict(x_test)
print(accuracy_score(gender_submission, y_pred))

0.9138755980861244

# DecisionTreeClassifier

In [124]:
dtc.fit(x_train, y_train)
y_pred = dtc.predict(x_test)
print(accuracy_score(gender_submission, y_pred))

0.7703349282296651

# KNeighborsClassifier

In [125]:
knc.fit(x_train, y_train)
y_pred = knc.predict(x_test)
print(accuracy_score(gender_submission, y_pred))

0.7009569377990431